export const coalStructure: MyComponent[] = [
  {
    name: '磨煤机',
    drew: false,
    shapeType: '',
    nArray: 5,
    arrayPrefix: ['A', 'B', 'C', 'D', 'E'],
    arrayMatchingResults: [[0, 0], [0, 0], [0, 0], [0, 0]],
    initPoint: [0, 0],
    shapeRefined: [],
    shape: [
      [100 + 300, 100],
      [100 + 300, 200],
      [300 + 500, 200],
      [300 + 500, 100],
    ],
    graphicalFeature: {
      leftTopX: 0,
      leftTopY: 0,
      componentWidth: 0,
      componentHeight: 0,
    },
    sensorPositions: [],
    sensorValidPositions: [],
    hullPaths: [],
    links: [],
    mapping: {},
    validSensors: [],
    d: 30,
    nSensor: 13,
    sensorGroups: [
      {
        aspect: 'location',
        groups: [
          [
            '磨煤机电流',
          ],
          [
            '给煤机煤量',
          ],
          [
            '磨煤机入口热风隔绝门前一次风压力',
            '磨煤机入口密封风压力',
            '磨煤机入口一次风风量2',
            '磨煤机入口一次风风温',
            '磨煤机入口热一次风气动调节门开度反馈',
            '磨煤机入口冷一次风气动调节门开度反馈',
          ],
          [
            '磨煤机密封风与一次风差压',
          ],
          [
            '磨煤机进口与分离器出口差压',
          ],
          [
            '磨煤机出口风压',
            '磨出口风粉混合物温度',
          ],
          [
            '磨煤机变频器频率反馈',
          ],
        ]
      },
      {
        aspect: 'measurement',
        groups: [
          [
            '磨煤机电流',
          ],
          [
            '给煤机煤量',
          ],
          [
            '磨煤机入口热风隔绝门前一次风压力',
            '磨煤机入口密封风压力',
            '磨煤机密封风与一次风差压',
            '磨煤机进口与分离器出口差压',
            '磨煤机出口风压',
          ],
          [
            '磨出口风粉混合物温度',
            '磨煤机入口一次风风温',
          ],
          [
            '磨煤机入口一次风风量2'
          ],
          [
            '磨煤机变频器频率反馈',
            '磨煤机入口热一次风气动调节门开度反馈',
            '磨煤机入口冷一次风气动调节门开度反馈',
          ],
        ]
      }
    ]
  },
  {
    name: '风机',
    drew: false,
    shapeType: '',
    nArray: 1,
    arrayPrefix: [],
    initPoint: [0, 0],
    shapeRefined: [],
    shape: [
      [100 + 300, 0 + 250],
      [100 + 300, 200 + 250],
      [300 + 300, 200 + 250],
      [300 + 300, 0 + 250],
    ],
    graphicalFeature: {
      leftTopX: 0,
      leftTopY: 0,
      componentWidth: 0,
      componentHeight: 0,
    },
    sensorPositions: [],
    sensorValidPositions: [],
    hullPaths: [],
    links: [],
    mapping: {},
    validSensors: [],
    d: 30,
    nSensor: 11,
    sensorGroups: [
      {
        aspect: 'location',
        groups: [
          [
            '12号送风机电流',
            '送风机动叶开度反馈',
          ],
          [
            '12号引风机电流',
            '引风机动叶开度反馈',
          ],
          [
            'AB侧二次风暖风器出口风压',
          ],
          [
            'A侧二次风暖风器出口风温2',
          ],
          [
            '12号一次风机电流',
            '冷一次风风量',
            '热一次风风量',
            '一次风机入口开度反馈',
            '一次风机速度反馈',
          ],
        ]
      },
      {
        aspect: 'measurement',
        groups: [
          [
            'AB侧二次风暖风器出口风压',
          ],
          [
            'A侧二次风暖风器出口风温2',
          ],
          [
            '12号一次风机电流',
            '12号引风机电流',
            '12号送风机电流',
          ],
          [
            '冷一次风风量',
            '热一次风风量',
          ],
          [
            '引风机动叶开度反馈',
            '一次风机入口开度反馈',
            '送风机动叶开度反馈',
            '一次风机速度反馈',
          ],
        ],
      }
    ],
  },
  {
    name: '过热器',
    drew: false,
    shapeType: '',
    nArray: 1,
    arrayPrefix: [],
    initPoint: [0, 0],
    shapeRefined: [],
    shape: [
      [200, 0 + 500],
      [200, 100 + 500],
      [300 + 500, 100 + 500],
      [300 + 500, 0 + 500],
    ],
    graphicalFeature: {
      leftTopX: 0,
      leftTopY: 0,
      componentWidth: 0,
      componentHeight: 0,
    },
    sensorPositions: [],
    sensorValidPositions: [],
    hullPaths: [],
    links: [],
    mapping: {},
    validSensors: [],
    d: 30,
    nSensor: 13,
    sensorGroups: [
      {
        aspect: 'location',
        groups: [
          [
            '过热度'
          ],
          [
            '后屏过热器壁温1',
            '后屏过热器壁温2',
            '后屏过热器壁温3',
          ],
          [
            '末级过热器壁温管壁温1',
            '末级过热器壁温管壁温2',
            '末级过热器壁温管壁温3',
            '末级过热器壁温管壁温4',
          ],
          [
            '分隔屏过热器左侧进口温度',
            '分隔屏过热器右侧进口温度',
          ],
          [
            '左侧末级过热器出口温度',
            '右侧末级过热器出口温度',
          ],
          [
            '末级过热器左侧入口烟气温度',
          ],
        ],
      },
      {
        aspect: 'measurement',
        groups: [
          [
            '过热度'
          ],
          [
            '后屏过热器壁温1',
            '后屏过热器壁温2',
            '后屏过热器壁温3',
            '末级过热器壁温管壁温1',
            '末级过热器壁温管壁温2',
            '末级过热器壁温管壁温3',
            '末级过热器壁温管壁温4',
            '分隔屏过热器左侧进口温度',
            '分隔屏过热器右侧进口温度',
            '左侧末级过热器出口温度',
            '右侧末级过热器出口温度',
            '末级过热器左侧入口烟气温度',
          ],
        ],
      }

    ],
  },
  {
    name: '减温器',
    drew: false,
    shapeType: '',
    nArray: 1,
    arrayPrefix: [],
    initPoint: [0, 0],
    shapeRefined: [],
    shape: [
      [100, 0 + 250],
      [100, 200 + 250],
      [350, 200 + 250],
      [350, 0 + 250],
    ],
    graphicalFeature: {
      leftTopX: 0,
      leftTopY: 0,
      componentWidth: 0,
      componentHeight: 0,
    },
    sensorPositions: [],
    sensorValidPositions: [],
    hullPaths: [],
    links: [],
    mapping: {},
    validSensors: [],
    d: 30,
    nSensor: 19,
    sensorGroups: [
      {
        aspect: 'location',
        groups: [
          [
            '过热器左侧一级喷水减温器进口温度',
            '过热器左侧一级减温器出口温度',
            '过热器左侧一级喷水减温调节电动门开度反馈',
          ],
          [
            '过热器右侧一级喷水减温器进口温度',
            '过热器右侧一级减温器出口温度',
            '过热器右侧一级减温水流量',
            '过热器右侧一级喷水减温调节电动门开度反馈',
          ],
          [
            '过热器左侧二级减温器进口温度',
            '过热器左侧二级减温器出口温度',
            '过热器左侧二级减温水流量1',
            '过热器左侧二级喷水减温调节电动门开度反馈'
          ],
          [
            '过热器右侧二级减温器进口温度',
            '过热器右侧二级减温器出口温度',
            '过热器右侧二级减温水流量',
            '过热器右侧二级喷水减温调节电动门开度反馈'
          ],
          [
            '再热器左侧减温器进口温度',
            '再热器左侧减温器出口温度',
          ],
          [
            '再热器右侧减温器进口温度',
            '再热器右侧减温器出口温度',
          ]
        ]

      },
      {
        aspect: 'measurement',
        groups: [
          [
            '过热器左侧一级喷水减温器进口温度',
            '过热器左侧一级减温器出口温度',
            '过热器右侧一级喷水减温器进口温度',
            '过热器右侧一级减温器出口温度',
            '过热器左侧二级减温器进口温度',
            '过热器左侧二级减温器出口温度',
            '过热器右侧二级减温器进口温度',
            '过热器右侧二级减温器出口温度',
            '再热器左侧减温器进口温度',
            '再热器左侧减温器出口温度',
            '再热器右侧减温器进口温度',
            '再热器右侧减温器出口温度',
          ],
          [
            '过热器右侧一级减温水流量',
            '过热器左侧二级减温水流量1',
            '过热器右侧二级减温水流量',
          ],
          [
            '过热器右侧一级喷水减温调节电动门开度反馈',
            '过热器左侧一级喷水减温调节电动门开度反馈',
            '过热器左侧二级喷水减温调节电动门开度反馈',
            '过热器右侧二级喷水减温调节电动门开度反馈',
          ],
        ],
      }
    ],
  },
  {
    name: '空预器',
    drew: false,
    shapeType: '',
    nArray: 1,
    arrayPrefix: [],
    initPoint: [0, 0],
    shapeRefined: [],
    shape: [
      [100 + 550, 0 + 250],
      [100 + 550, 200 + 250],
      [300 + 600, 200 + 250],
      [300 + 600, 0 + 250],
    ],
    graphicalFeature: {
      leftTopX: 0,
      leftTopY: 0,
      componentWidth: 0,
      componentHeight: 0,
    },
    sensorPositions: [],
    sensorValidPositions: [],
    hullPaths: [],
    links: [],
    mapping: {},
    validSensors: [],
    d: 30,
    nSensor: 12,
    sensorGroups: [
      {
        aspect: 'location',
        groups: [
          [
            'A侧空预器入口烟气含氧量',
            'A侧预热器入口烟气温度',

          ],
          [
            'B侧空预器入口烟气含氧量',
            'B侧预热器入口烟气温度1',
          ],
          [
            'AB侧空预器出口烟气温度',
            'AB侧空预器出口一次风压力',
            'AB侧空预器出口一次风温',
          ],
          [
            'AB侧空预器进出口烟气差压',
          ],
          [
            'AB侧空气预热器二次风风压',
          ],
          [
            'AB侧空预器入口一次风温',
          ],
          [
            '左侧空预器冷端温度调节阀开度反馈',
          ],
          [
            '右侧空预器冷端温度调节阀开度反馈',
          ],
        ]
      },
      {
        aspect: 'measurement',
        groups: [
          [
            'A侧空预器入口烟气含氧量',
            'B侧空预器入口烟气含氧量',
          ],
          [
            'A侧预热器入口烟气温度',
            'B侧预热器入口烟气温度1',
            'AB侧空预器出口烟气温度',
          ],
          [
            'AB侧空预器进出口烟气差压',
            'AB侧空预器出口一次风压力',
            'AB侧空气预热器二次风风压',
          ],
          [
            'AB侧空预器入口一次风温', 'AB侧空预器出口一次风温',
          ],
          [
            '左侧空预器冷端温度调节阀开度反馈',
            '右侧空预器冷端温度调节阀开度反馈',
          ],
        ],
      }
    ],
  },
  {
    name: '炉膛',
    drew: false,
    shapeType: '',
    nArray: 1,
    arrayPrefix: [],
    initPoint: [0, 0],
    shapeRefined: [],
    shape: [
      [100 + 550, 0 + 250],
      [100 + 550, 200 + 250],
      [300 + 600, 200 + 250],
      [300 + 600, 0 + 250],
    ],
    graphicalFeature: {
      leftTopX: 0,
      leftTopY: 0,
      componentWidth: 0,
      componentHeight: 0,
    },
    sensorPositions: [],
    sensorValidPositions: [],
    hullPaths: [],
    links: [],
    mapping: {},
    validSensors: [],
    d: 30,
    nSensor: 43,
    sensorGroups: [
      {
        aspect: 'location',
        groups: [
          [
            '炉膛与左侧大风箱差压',
            '炉膛与左侧热一次风差压',
          ],
          [
            '螺旋管前墙水冷壁壁温',
            '螺旋管左侧墙水冷壁壁温',
            '螺旋管后墙水冷壁壁温',
            '螺旋管右侧墙水冷壁壁温',
          ],
          [
            '炉膛与右侧大风箱差压',
            '炉膛与右侧热一次风差压',
          ],
          [
            '炉膛左侧墙垂直管壁温1',
            '炉膛左侧墙垂直管壁温2',
          ],
          [
            '炉膛后墙屏管壁温1',
            '炉膛后墙屏管壁温2',
          ],
          [
            '炉膛后墙悬吊管壁温1',
            '炉膛后墙悬吊管壁温2',
          ],
          [
            '炉膛右侧墙垂直管壁温1',
            '炉膛右侧墙垂直管壁温2',
          ],
          [
            '分隔屏金属壁温1',
            '分隔屏金属壁温2',
          ],
          [
            '炉膛A侧出口烟温',
            'A侧红外测温温度',
          ],
          [
            '炉膛B侧出口烟温',
            'B侧红外测温温度',
          ],
          [
            '第AA层风门开度反馈',
            '第A层风门开度反馈',
            '第AB层风门开度反馈',
            '第B层风门开度反馈',
            '第BC层风门开度反馈',
            '第C层风门开度反馈',
            '第CD层风门开度反馈',
            '第D层风门开度反馈',
            '第DE层风门开度反馈',
            '第E层风门开度反馈',
            '第EE层风门开度反馈',
          ],
          [
            'UAP-1开度反馈',
            'UAP-2开度反馈',
          ],
          [
            'AGP-Ⅰ层分离燃尽风风门开度反馈',
            'AGP-Ⅱ层分离燃尽风风门开度反馈',
            'AGP-Ⅲ层分离燃尽风风门开度反馈',
            'AGP-Ⅳ层分离燃尽风风门开度反馈',
          ],
          [
            '摆动燃烧器开度反馈',
          ],
          [
            'AGP摆动燃烧器开度反馈'
          ],
          [
            '氧量',
          ],
          [
            '炉膛前墙垂直管壁温',
          ],
        ],
      },
      {
        aspect: 'measurement',
        groups: [
          [
            '氧量',
          ],
          [
            '炉膛与左侧大风箱差压',
            '炉膛与右侧大风箱差压',
            '炉膛与左侧热一次风差压',
            '炉膛与右侧热一次风差压',
          ],
          [
            '螺旋管前墙水冷壁壁温',
            '螺旋管左侧墙水冷壁壁温',
            '螺旋管后墙水冷壁壁温',
            '螺旋管右侧墙水冷壁壁温',
            '炉膛前墙垂直管壁温',
            '炉膛左侧墙垂直管壁温1',
            '炉膛左侧墙垂直管壁温2',
            '炉膛后墙屏管壁温1',
            '炉膛后墙屏管壁温2',
            '炉膛后墙悬吊管壁温1',
            '炉膛后墙悬吊管壁温2',
            '炉膛右侧墙垂直管壁温1',
            '炉膛右侧墙垂直管壁温2',
            '分隔屏金属壁温1',
            '分隔屏金属壁温2',
            'A侧红外测温温度',
            'B侧红外测温温度',
            '炉膛A侧出口烟温',
            '炉膛B侧出口烟温',
          ],
          [
            '第AA层风门开度反馈',
            '第A层风门开度反馈',
            '第AB层风门开度反馈',
            '第B层风门开度反馈',
            '第BC层风门开度反馈',
            '第C层风门开度反馈',
            '第CD层风门开度反馈',
            '第D层风门开度反馈',
            '第DE层风门开度反馈',
            '第E层风门开度反馈',
            '第EE层风门开度反馈',
            'UAP-1开度反馈',
            'UAP-2开度反馈',
            'AGP-Ⅰ层分离燃尽风风门开度反馈',
            'AGP-Ⅱ层分离燃尽风风门开度反馈',
            'AGP-Ⅲ层分离燃尽风风门开度反馈',
            'AGP-Ⅳ层分离燃尽风风门开度反馈',
            '摆动燃烧器开度反馈',
            'AGP摆动燃烧器开度反馈'
          ],
        ],
      },
    ],
  },
  {
    name: '煤渣',
    drew: false,
    shapeType: '',
    nArray: 1,
    arrayPrefix: [],
    initPoint: [0, 0],
    shapeRefined: [],
    shape: [
      [100 + 550, 0 + 250],
      [100 + 550, 200 + 250],
      [300 + 600, 200 + 250],
      [300 + 600, 0 + 250],
    ],
    graphicalFeature: {
      leftTopX: 0,
      leftTopY: 0,
      componentWidth: 0,
      componentHeight: 0,
    },
    sensorPositions: [],
    sensorValidPositions: [],
    hullPaths: [],
    links: [],
    mapping: {},
    validSensors: [],
    d: 30,
    nSensor: 6,
    sensorGroups: [
      {
        aspect: 'location',
        groups: [
          [
            '飞灰含碳量',
          ],
          [
            '收到基灰份',
          ],
          [
            '全水分',
          ],
          [
            '低位发热量',
          ],
          [
            '干燥无灰基挥发份',
          ],
          [
            '大渣可燃物含量'
          ],
        ]
      }, {
        aspect: 'measurement',
        groups: [
          [
            '飞灰含碳量',
          ],
          [
            '收到基灰份',
          ],
          [
            '全水分',
          ],
          [
            '低位发热量',
          ],
          [
            '干燥无灰基挥发份',
          ],
          [
            '大渣可燃物含量'
          ],
        ]
      },
    ],
  },
  {
    name: '省煤器',
    drew: false,
    shapeType: '',
    nArray: 1,
    arrayPrefix: [],
    initPoint: [0, 0],
    shapeRefined: [],
    shape: [
      [100 + 550, 0 + 250],
      [100 + 550, 200 + 250],
      [300 + 600, 200 + 250],
      [300 + 600, 0 + 250],
    ],
    graphicalFeature: {
      leftTopX: 0,
      leftTopY: 0,
      componentWidth: 0,
      componentHeight: 0,
    },
    sensorPositions: [],
    sensorValidPositions: [],
    hullPaths: [],
    links: [],
    mapping: {},
    validSensors: [],
    d: 30,
    nSensor: 2,
    sensorGroups: [
      {
        aspect: 'location',
        groups: [[
          '省煤器入口烟温',
          '省煤器左右侧出口烟温'
        ]],
      },
      {
        aspect: 'measurement',
        groups: [[
          '省煤器入口烟温',
          '省煤器左右侧出口烟温'
        ]],
      },
    ],
  },
  {
    name: '再热器',
    drew: false,
    shapeType: '',
    nArray: 1,
    arrayPrefix: [],
    initPoint: [0, 0],
    shapeRefined: [],
    shape: [
      [100 + 550, 0 + 250],
      [100 + 550, 200 + 250],
      [300 + 600, 200 + 250],
      [300 + 600, 0 + 250],
    ],
    graphicalFeature: {
      leftTopX: 0,
      leftTopY: 0,
      componentWidth: 0,
      componentHeight: 0,
    },
    sensorPositions: [],
    sensorValidPositions: [],
    hullPaths: [],
    links: [],
    mapping: {},
    validSensors: [],
    d: 30,
    nSensor: 19,
    sensorGroups: [
      {
        aspect: 'location',
        groups: [
          [
            '热再热蒸汽母管温度',
          ],
          [
            '低温再热器壁温1',
            '低温再热器壁温2',
            '低温再热器壁温3',
            '低温再热器壁温4',
          ],
          [
            '高温再热器壁温1',
            '高温再热器壁温2',
            '高温再热器壁温3',
            '高温再热器壁温4',
            '高温再热器壁温5',
            '高温再热器壁温6',
          ],
          [
            '末级再热器右侧进口温度',
            '末级再热器左侧进口温度',
          ],
          [
            '高温再热器左侧出口温度',
            '高温再热器右侧出口温度',
          ],
          [
            '低温再热器入口烟温',
          ],
          [
            '末级再热器后烟温',
          ],
          [
            '水平低温再热器右侧入口烟气温度',
            '水平低温再热器右侧出口烟气温度'
          ],
        ]
      },
      {
        aspect: 'measurement',
        groups: [
          [
            '热再热蒸汽母管温度',
            '低温再热器壁温1',
            '低温再热器壁温2',
            '低温再热器壁温3',
            '低温再热器壁温4',
            '高温再热器壁温1',
            '高温再热器壁温2',
            '高温再热器壁温3',
            '高温再热器壁温4',
            '高温再热器壁温5',
            '高温再热器壁温6',
            '末级再热器右侧进口温度',
            '末级再热器左侧进口温度',
            '高温再热器左侧出口温度',
            '高温再热器右侧出口温度',
            '低温再热器入口烟温',
            '末级再热器后烟温',
            '水平低温再热器右侧入口烟气温度',
            '水平低温再热器右侧出口烟气温度'
          ],
        ]
      },
    ],
  },
  // {
  //   name: '总状态组',
  //   drew: false,
  //   shapeType: '',
  //   nArray: 1,
  //   arrayPrefix: [],
  //   initPoint: [0, 0],
  //   shapeRefined: [],
  //   shape: [
  //     [100 + 550, 0 + 250],
  //     [100 + 550, 200 + 250],
  //     [300 + 600, 200 + 250],
  //     [300 + 600, 0 + 250],
  //   ],
  //   graphicalFeature: {
  //     leftTopX: 0,
  //     leftTopY: 0,
  //     componentWidth: 0,
  //     componentHeight: 0,
  //   },
  //   sensorPositions: [],
  //   mapping: {},
  //   d: 30,
  //   nSensor: 13,
  //   sensors: [
  //     [
  //       '炉膛负压',
  //       '主汽压',
  //       '再热汽压',
  //     ],
  //     [
  //       '给水流量',
  //       'SCR反应器1脱硝前烟气NOX',
  //       '主蒸汽温度',

  //       '主蒸汽流量',

  //       '负荷',
  //       '总风量',
  //       '总煤量',
  //       '需求负荷',
  //       '3机环境温度',
  //       '发电效率'

  //     ],
  //   ],
  // },
]

export const coalSensorNames: string[] = [
  "A磨煤机电流",
  "A磨煤机进口与分离器出口差压",
  "A磨煤机入口一次风风量2",
  "A磨煤机入口热风隔绝门前一次风压力",
  "A磨煤机入口密封风压力",
  "A磨煤机密封风与一次风差压",
  "A磨出口风粉混合物温度",
  "A给煤机煤量",
  "A磨煤机入口一次风风温",
  "A磨煤机出口风压",
  "B磨煤机电流",
  "B磨煤机进口与分离器出口差压",
  "B磨煤机入口一次风风量2",
  "B磨煤机入口热风隔绝门前一次风压力",
  "B磨煤机入口密封风压力",
  "B磨煤机密封风与一次风差压",
  "B磨出口风粉混合物温度",
  "B给煤机煤量",
  "B磨煤机入口一次风风温",
  "B磨煤机出口风压",
  "C磨煤机电流",
  "C磨煤机进口与分离器出口差压",
  "C磨煤机入口一次风风量2",
  "C磨煤机入口热风隔绝门前一次风压力",
  "C磨煤机入口密封风压力",
  "C磨煤机密封风与一次风差压",
  "C磨出口风粉混合物温度",
  "C给煤机煤量",
  "C磨煤机入口一次风风温",
  "C磨煤机出口风压",
  "D磨煤机电流",
  "D磨煤机进口与分离器出口差压",
  "D磨煤机入口一次风风量2",
  "D磨煤机入口热风隔绝门前一次风压力",
  "D磨煤机入口密封风压力",
  "D磨煤机密封风与一次风差压",
  "D磨出口风粉混合物温度",
  "D给煤机煤量",
  "D磨煤机入口一次风风温",
  "D磨煤机出口风压",
  "E磨煤机电流",
  "E磨煤机进口与分离器出口差压",
  "E磨煤机入口一次风风量2",
  "E磨煤机入口热风隔绝门前一次风压力",
  "E磨煤机入口密封风压力",
  "E磨煤机密封风与一次风差压",
  "E磨出口风粉混合物温度",
  "E给煤机煤量",
  "E磨煤机入口一次风风温",
  "E磨煤机出口风压",
  "炉膛负压",
  "给水流量",
  "#SCR反应器1脱硝前烟气NOX",
  "主蒸汽温度",
  "再热汽压",
  "主蒸汽流量",
  "主汽压",
  "负荷",
  "氧量",
  "热再热蒸汽母管温度",
  "总风量",
  "过热度",
  "总煤量",
  "炉膛与左侧大风箱差压",
  "炉膛与左侧热一次风差压",
  "炉膛与右侧大风箱差压",
  "炉膛与右侧热一次风差压",
  "螺旋管前墙水冷壁壁温",
  "螺旋管左侧墙水冷壁壁温",
  "螺旋管后墙水冷壁壁温",
  "螺旋管右侧墙水冷壁壁温",
  "炉膛前墙垂直管壁温",
  "炉膛左侧墙垂直管壁温1",
  "炉膛左侧墙垂直管壁温2",
  "炉膛后墙屏管壁温1",
  "炉膛后墙屏管壁温2",
  "炉膛后墙悬吊管壁温1",
  "炉膛后墙悬吊管壁温2",
  "炉膛右侧墙垂直管壁温1",
  "炉膛右侧墙垂直管壁温2",
  "分隔屏金属壁温1",
  "分隔屏金属壁温2",
  "后屏过热器壁温1",
  "后屏过热器壁温2",
  "后屏过热器壁温3",
  "末级过热器壁温管壁温1",
  "末级过热器壁温管壁温2",
  "末级过热器壁温管壁温3",
  "末级过热器壁温管壁温4",
  "低温再热器壁温1",
  "低温再热器壁温2",
  "低温再热器壁温3",
  "低温再热器壁温4",
  "高温再热器壁温1",
  "高温再热器壁温2",
  "高温再热器壁温3",
  "高温再热器壁温4",
  "高温再热器壁温5",
  "高温再热器壁温6",
  "分隔屏过热器左侧进口温度",
  "分隔屏过热器右侧进口温度",
  "过热器左侧一级喷水减温器进口温度",
  "过热器左侧一级减温器出口温度",
  "过热器右侧一级喷水减温器进口温度",
  "过热器右侧一级减温器出口温度",
  "过热器左侧二级减温器进口温度",
  "过热器左侧二级减温器出口温度",
  "过热器右侧二级减温器进口温度",
  "过热器右侧二级减温器出口温度",
  "过热器右侧一级减温水流量",
  "过热器左侧二级减温水流量1",
  "过热器右侧二级减温水流量",
  "左侧末级过热器出口温度",
  "右侧末级过热器出口温度",
  "再热器左侧减温器进口温度",
  "再热器左侧减温器出口温度",
  "再热器右侧减温器进口温度",
  "再热器右侧减温器出口温度",
  "末级再热器右侧进口温度",
  "末级再热器左侧进口温度",
  "高温再热器左侧出口温度",
  "高温再热器右侧出口温度",
  "A侧空预器入口烟气含氧量",
  "B侧空预器入口烟气含氧量",
  "A侧预热器入口烟气温度",
  "B侧预热器入口烟气温度1",
  "AB侧空预器出口烟气温度",
  "AB侧空预器进出口烟气差压",
  "AB侧空预器入口一次风温",
  "AB侧空预器出口一次风压力",
  "AB侧空预器出口一次风温",
  "AB侧空气预热器二次风风压",
  "AB侧二次风暖风器出口风压",
  "A侧二次风暖风器出口风温2",
  "12号一次风机电流",
  "12号引风机电流",
  "12号送风机电流",
  "冷一次风风量",
  "热一次风风量",
  "炉膛A侧出口烟温",
  "炉膛B侧出口烟温",
  "A侧红外测温温度",
  "B侧红外测温温度",
  "末级过热器左侧入口烟气温度",
  "低温再热器入口烟温",
  "省煤器入口烟温",
  "末级再热器后烟温",
  "水平低温再热器右侧入口烟气温度",
  "水平低温再热器右侧出口烟气温度",
  "省煤器左右侧出口烟温",
  "需求负荷",
  "#3机环境温度",
  "飞灰含碳量",
  "收到基灰份",
  "全水分",
  "低位发热量",
  "干燥无灰基挥发份",
  "大渣可燃物含量",
  "A磨煤机变频器频率反馈",
  "B磨煤机变频器频率反馈",
  "C磨煤机变频器频率反馈",
  "D磨煤机变频器频率反馈",
  "E磨煤机变频器频率反馈",
  "A磨煤机入口热一次风气动调节门开度反馈",
  "A磨煤机入口冷一次风气动调节门开度反馈",
  "B磨煤机入口热一次风气动调节门开度反馈",
  "B磨煤机入口冷一次风气动调节门开度反馈",
  "C磨煤机入口热一次风气动调节门开度反馈",
  "C磨煤机入口冷一次风气动调节门开度反馈",
  "D磨煤机入口热一次风气动调节门开度反馈",
  "D磨煤机入口冷一次风气动调节门开度反馈",
  "E磨煤机入口热一次风气动调节门开度反馈",
  "E磨煤机入口冷一次风气动调节门开度反馈",
  "第AA层风门开度反馈",
  "第A层风门开度反馈",
  "第AB层风门开度反馈",
  "第B层风门开度反馈",
  "第BC层风门开度反馈",
  "第C层风门开度反馈",
  "第CD层风门开度反馈",
  "第D层风门开度反馈",
  "第DE层风门开度反馈",
  "第E层风门开度反馈",
  "第EE层风门开度反馈",
  "UAP-1开度反馈",
  "UAP-2开度反馈",
  "AGP-Ⅰ层分离燃尽风风门开度反馈",
  "AGP-Ⅱ层分离燃尽风风门开度反馈",
  "AGP-Ⅲ层分离燃尽风风门开度反馈",
  "AGP-Ⅳ层分离燃尽风风门开度反馈",
  "摆动燃烧器开度反馈",
  "AGP摆动燃烧器开度反馈",
  "过热器右侧一级喷水减温调节电动门开度反馈",
  "过热器左侧一级喷水减温调节电动门开度反馈",
  "过热器左侧二级喷水减温调节电动门开度反馈",
  "过热器右侧二级喷水减温调节电动门开度反馈",
  "引风机动叶开度反馈",
  "一次风机入口开度反馈",
  "送风机动叶开度反馈",
  "一次风机速度反馈",
  "左侧空预器冷端温度调节阀开度反馈",
  "右侧空预器冷端温度调节阀开度反馈",
  "时间戳"
]

export const coalGroupsByType: [string[], string[], string[]] = [
  ['过热器左侧一级喷水减温调节电动门开度反馈'],
  [],
  ['A磨煤机电流', 'A磨煤机进口与分离器出口差压', 'A磨煤机入口一次风风量2', 'A磨煤机入口热风隔绝门前一次风压力', 'A磨煤机入口密封风压力', 'A磨煤机密封风与一次风差压', 'A磨出口风粉混合物温度', 'A给煤机煤量', 'A磨煤机入口一次风风温', 'A磨煤机出口风压', 'B磨煤机电流', 'B磨煤机进口与分离器出口差压', 'B磨煤机入口一次风风量2', 'B磨煤机入口热风隔绝门前一次风 压力', 'B磨煤机入口密封风压力', 'B磨煤机密封风与一次风差压', 'B磨出口风粉混合物温度', 'B给煤机煤量', 'B磨煤机入口一次 风风温', 'B磨煤机出口风压', 'C磨煤机电流', 'C磨煤机进口与分离器出口差压', 'C磨煤机入口一次风风量2', 'C磨煤机入口热风隔绝门前一次风压力', 'C磨煤机入口密封风压力', 'C磨煤机密封风与一次风差压', 'C磨出口风粉混合物温度', 'C给煤机煤量', 'C磨煤 机入口一次风风温', 'C磨煤机出口风压', 'D磨煤机电流', 'D磨煤机进口与分离器出口差压', 'D磨煤机入口一次风风量2', 'D磨煤机入口热风隔绝门前一次风压力', 'D磨煤机入口密封风压力', 'D磨煤机密封风与一次风差压', 'D磨出口风粉混合物温度', 'D给煤机煤量', 'D磨煤机入口一次风风温', 'D磨煤机出口风压', 'E磨煤机电流', 'E磨煤机进口与分离器出口差压', 'E磨煤机入口一次风风量2', 'E磨煤机入口热风隔绝门前一次风压力', 'E磨煤机入口密封风压力', 'E磨煤机密封风与一次风差压', 'E磨出口风粉混合物温度', 'E给煤机煤量', 'E磨煤机入口一次风风温', 'E磨煤机出口风压', '炉膛负压', '给水流量', '#SCR反应器1脱硝前烟气NOX', '主蒸汽温度', '再热汽压', '主蒸汽流量', '主汽压', '负荷', '氧量', '热再热蒸汽母管温度', '总风量', '过热度', '总煤量', '炉膛与左侧大风箱差压', '炉膛与左侧热一次风差压', '炉膛与右侧大风箱差压', '炉膛与右侧热一次风差压', '螺旋管前墙水冷壁壁温', '螺旋管左侧墙水冷壁壁温', '螺旋管后墙水冷壁壁温', '螺旋管右侧墙水冷壁壁温', '炉膛前墙垂直管壁温', '炉膛左侧墙垂直管壁温1', '炉膛左侧墙垂直管壁温2', '炉膛后墙屏管壁温1', '炉膛后墙屏管壁温2', '炉膛后墙悬吊管壁温1', '炉膛后墙悬吊管壁温2', '炉膛右侧墙垂直管壁温1', '炉膛右侧墙垂直管壁温2', '分隔屏金属壁温1', '分隔屏金属壁温2', '后屏过热器壁温1', '后屏过热器壁温2', '后屏过热器壁温3', '末级过热器壁温管壁温1', '末级过热器壁温管壁温2', '末级过热器壁温管壁温3', '末级过热器壁温管壁温4', '低温再热器壁温1', '低温再热器壁温2', '低温再热器壁温3', '低温再热器壁温4', '高温再热器壁温1', '高温再热器壁温2', '高温 再热器壁温3', '高温再热器壁温4', '高温再热器壁温5', '高温再热器壁温6', '分隔屏过热器左侧进口温度', '分隔屏过热器右侧进口温度', '过热器左侧一级喷水减温器进口温度', '过热器左侧一级减温器出口温度', '过热器右侧一级喷水减温器进口温度', '过热器右侧一级减温器出口温度', '过热器左侧二级减温器进口温度', '过热器左侧二级减温器出口温度', '过热器右侧二级减温器进口温度', '过热器右侧二级减温器出口温度', '过热器右侧一级减温水流量', '过热器左侧二级减温水流量1', '过热器右侧二级减温水流量', '左 侧末级过热器出口温度', '右侧末级过热器出口温度', '再热器左侧减温器进口温度', '再热器左侧减温器出口温度', '再热器右侧减温器进口温度', '再热器右侧减温器出口温度', '末级再热器右侧进口温度', '末级再热器左侧进口温度', '高温再热器左侧出口温度', '高温再热器右侧出口温度', 'A侧空预器入口烟气含氧量', 'B侧空预器入口烟气含氧量', 'A侧预热器入口烟气温度', 'B侧预热器入口烟气温度1', 'AB侧空预器出口烟气温度', 'AB侧空预器进出口烟气差压', 'AB侧空预器入口一次风温', 'AB侧空预器出口一次风压力', 'AB侧空预器出口一次风温', 'AB侧空气预热器二次风风压', 'AB侧二次风暖风器出口风压', 'A侧二次风暖风器出口风温2', '12号一次风 机电流', '12号引风机电流', '12号送风机电流', '冷一次风风量', '热一次风风量', '炉膛A侧出口烟温', '炉膛B侧出口烟温', 'A侧 红外测温温度', 'B侧红外测温温度', '末级过热器左侧入口烟气温度', '低温再热器入口烟温', '省煤器入口烟温', '末级再热 器后烟温', '水平低温再热器右侧入口烟气温度', '水平低温再热器右侧出口烟气温度', '省煤器左右侧出口烟温', '需求负荷', '#3机环境温度', '飞灰含碳量', '收到基灰份', '全水分', '低位发热量', '干燥无灰基挥发份', '大渣可燃物含量', 'A磨煤机变频器频率 反馈', 'B磨煤机变频器频率反馈', 'C磨煤机变频器频率反馈', 'D磨煤机变频器频率反馈', 'E磨煤机变频器频率反馈', 'A磨煤机入口 热一次风气动调节门开度反馈', 'A磨煤机入口冷一次风气动调节门开度反馈', 'B磨煤机入口热一次风气动调节门开度反馈', 'B磨煤机 入口冷一次风气动调节门开度反馈', 'C磨煤机入口热一次风气动调节门开度反馈', 'C磨煤机入口冷一次风气动调节门开度反馈', 'D磨 煤机入口热一次风气动调节门开度反馈', 'D磨煤机入口冷一次风气动调节门开度反馈', 'E磨煤机入口热一次风气动调节门开度反馈', 'E磨煤机入口冷一次风气动调节门开度反馈', '第AA层风门开度反馈', '第A层风门开度反馈', '第AB层风门开度反馈', '第B层风门开度 反馈', '第BC层风门开度反馈', '第C层风门开度反馈', '第CD层风门开度反馈', '第D层风门开度反馈', '第DE层风门开度反馈', '第E 层风门开度反馈', '第EE层风门开度反馈', 'UAP-1开度反馈', 'UAP-2开度反馈', 'AGP-Ⅰ层分离燃尽风风门开度反馈', 'AGP-Ⅱ层分离燃尽风风门开度反馈', 'AGP-Ⅲ层分离燃尽风风门开度反馈', 'AGP-Ⅳ层分离燃尽风风门开度反馈', '摆动燃烧器开度反馈', 'AGP摆动燃烧 器开度反馈', '过热器右侧一级喷水减温调节电动门开度反馈', '过热器左侧二级喷水减温调节电动门开度反馈', '过热器右侧二级喷水减温调节电动门开度反馈', '引风机动叶开度反馈', '一次风机入口开度反馈', '送风机动叶开度反馈', '一次风机速度反馈', '左侧空预器冷端温度调节阀开度反馈', '右侧空预器冷端温度调节阀开度反馈', '时间戳']
]